ondiiik/micropython-espboards/ports/esp32/boards/ESP32_CAM/drivers/driver/camera.c
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "time.h"
#include "sys/time.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "soc/soc.h"
#include "soc/gpio_sig_map.h"
#include "soc/i2s_reg.h"
#include "soc/i2s_struct.h"
#include "soc/io_mux_reg.h"
#include "driver/gpio.h"
#include "driver/rtc_io.h"
#include "driver/periph_ctrl.h"
#include "esp_intr_alloc.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "sensor.h"
#include "sccb.h"
#include "esp_camera.h"
#include "camera_common.h"
#include "xclk.h"
#if CONFIG_OV2640_SUPPORT
#include "ov2640.h"
#endif
#if CONFIG_OV7725_SUPPORT
#include "ov7725.h"
#endif
#if CONFIG_OV3660_SUPPORT
#include "ov3660.h"
#endif
#if CONFIG_OV5640_SUPPORT
#include "ov5640.h"
#endif

typedef enum
{
    CAMERA_NONE = 0,
    CAMERA_UNKNOWN = 1,
    CAMERA_OV7725 = 7725,
    CAMERA_OV2640 = 2640,
    CAMERA_OV3660 = 3660,
    CAMERA_OV5640 = 5640,
} camera_model_t;

#define REG_PID        0x0A
#define REG_VER        0x0B
#define REG_MIDH       0x1C
#define REG_MIDL       0x1D

#define REG16_CHIDH     0x300A
#define REG16_CHIDL     0x300B

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define TAG ""
#else
#include "esp_log.h"
static const char* TAG = "camera";
#endif
#include "mp.h"
static const char* CAMERA_SENSOR_NVS_KEY = "sensor";
static const char* CAMERA_PIXFORMAT_NVS_KEY = "pixformat";

typedef struct fb_s
{
    uint8_t* buf;
    size_t len;
    struct fb_s* next;
} fb_item_t;

static void i2s_init();
static int i2s_run();
static void IRAM_ATTR vsync_isr(void* arg);
static void IRAM_ATTR i2s_isr(void* arg);
static esp_err_t dma_desc_init();
static void dma_desc_deinit();
static void dma_filter_task(void* pvParameters);
static void dma_filter_grayscale(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst);
static void dma_filter_grayscale_highspeed(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst);
static void dma_filter_yuyv(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst);
static void dma_filter_yuyv_highspeed(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst);
static void dma_filter_jpeg(const dma_elem_t* src, lldesc_t* dma_desc, uint8_t* dst);
static void i2s_stop(bool* need_yield);

static bool is_hs_mode()
{
    return s_state->config.xclk_freq_hz > 10000000;
}

static size_t i2s_bytes_per_sample(i2s_sampling_mode_t mode)
{
    switch (mode)
    {
        case SM_0A00_0B00:
            return 4;
        case SM_0A0B_0B0C:
            return 4;
        case SM_0A0B_0C0D:
            return 2;
        default:
            assert(0 && "invalid sampling mode");
            return 0;
    }
}

static int IRAM_ATTR _gpio_get_level(gpio_num_t gpio_num)
{
    if (gpio_num < 32)
    {
        return (GPIO.in >> gpio_num) & 0x1;
    }
    else
    {
        return (GPIO.in1.data >> (gpio_num - 32)) & 0x1;
    }
}

static void IRAM_ATTR vsync_intr_disable()
{
    gpio_set_intr_type(s_state->config.pin_vsync, GPIO_INTR_DISABLE);
}

static void vsync_intr_enable()
{
    gpio_set_intr_type(s_state->config.pin_vsync, GPIO_INTR_NEGEDGE);
}

static void skip_frame()
{
    if (s_state == NULL)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not initialized"));
    }
    
    int64_t st_t = esp_timer_get_time();
    while (_gpio_get_level(s_state->config.pin_vsync) == 0)
    {
        if ((esp_timer_get_time() - st_t) > 1000000LL)
        {
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Timeout waiting for VSYNC"));
        }
    }
    while (_gpio_get_level(s_state->config.pin_vsync) != 0)
    {
        if ((esp_timer_get_time() - st_t) > 1000000LL)
        {
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Timeout waiting for VSYNC"));
        }
    }
    while (_gpio_get_level(s_state->config.pin_vsync) == 0)
    {
        if ((esp_timer_get_time() - st_t) > 1000000LL)
        {
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Timeout waiting for VSYNC"));
        }
    }
}

static esp_err_t dma_desc_init()
{
    if (0 != (s_state->width % 4))
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Frame width shall be aligned to 4 bytes"));
    }
    
    
    size_t line_size = s_state->width * s_state->in_bytes_per_pixel * i2s_bytes_per_sample(s_state->sampling_mode);
    MP_LOGD(TAG, "Line size (for DMA): %d bytes [W%d, BPP%d, I2S%d]",
            line_size,
            s_state->width,
            s_state->in_bytes_per_pixel,
            i2s_bytes_per_sample(s_state->sampling_mode));
    
    size_t dma_per_line = 1;
    size_t buf_size     = line_size;
    
    while (buf_size >= 4096)
    {
        buf_size     /= 2;
        dma_per_line *= 2;
    }
    
    size_t dma_desc_count   = dma_per_line * 4;
    s_state->dma_buf_width  = line_size;
    s_state->dma_per_line   = dma_per_line;
    s_state->dma_desc_count = dma_desc_count;
    MP_LOGD(TAG, "DMA buffer size:     %d, DMA buffers per line: %d", buf_size, dma_per_line);
    MP_LOGD(TAG, "DMA buffer count:    %d", dma_desc_count);
    MP_LOGD(TAG, "DMA buffer total:    %d bytes", buf_size * dma_desc_count);
    
    s_state->dma_buf = (dma_elem_t**)malloc(sizeof(dma_elem_t*) * dma_desc_count);
    
    if (s_state->dma_buf == NULL)
    {
        return ESP_ERR_NO_MEM;
    }
    
    s_state->dma_desc = (lldesc_t*) malloc(sizeof(lldesc_t) * dma_desc_count);
    
    if (s_state->dma_desc == NULL)
    {
        return ESP_ERR_NO_MEM;
    }
    
    size_t dma_sample_count = 0;
    
    for (int i = 0; i < dma_desc_count; ++i)
    {
        MP_LOGD(TAG, "Allocating DMA buffer #%d, size=%d", i, buf_size);
        
